app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" DESC LIMIT 1

  def create
    @task = current_user.tasks.build(task_params)
    #

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "recipientemail", "recipientname", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def send_mail
    @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "task.id"]]